adns
apache-flink
apache-spark
aria2
autoconf
autojump
automake
autossh
bison
boost
chruby
chruby-fish
chunkwm
cmake
coreutils
diff-so-fancy
docker
docker-compose
docker-machine
elvish
et
ffmpeg
fish
freetype
fswatch
fzf
gdbm
gettext
gflags
git
glib
glog
gmp
gnu-sed
gnupg
gnutls
htop
hub
icu4c
imagemagick
influxdb
jenv
jpeg
jq
kafka
khd
kwm
lame
leiningen
libassuan
libevent
libffi
libgcrypt
libgpg-error
libidn2
libksba
libpng
libsodium
libtasn1
libtiff
libtool
libunistring
libusb
libyaml
libzip
lzo
lzop
magic-wormhole
mitmproxy
mobile-shell
mosh
mtr
multitail
ncdu
nettle
nginx
nmap
node
node@4
npth
nvm
oniguruma
openssh
openssl
openssl@1.1
p11-kit
pcre
pcre2
pinentry
pinentry-mac
pkg-config
postgresql
protobuf
pv
python
python3
python@2
qpdf
rbenv
readline
reattach-to-user-namespace
rename
ripgrep
ruby-build
ruby-install
sbt
scala
speedtest-cli
sqlite
sshfs
terminal-notifier
tfenv
the_silver_searcher
thefuck
tig
tldr
tmux
tree
typescript
vault
watch
wget
whatmask
x264
xvid
xz
youtube-dl
zookeeper
