amethyst
appearin
bartender
bitbar
caffeine
chefdk
cord
divvy
docker
emacs-mac
firefox
flume
flux
font-input
font-iosevka
forklift
gitify
google-cloud-sdk
hyper
java
macdown
osxfuse
pester
plex-media-server
postgres
skype
soulver
spark
steam
sublime-text
tower
unified-remote
vagrant
virtualbox
visual-studio-code
xee
xquartz
