adns
antibody
aom
apache-flink
apache-spark
applesimutils
aria2
autoconf
autojump
automake
autossh
awscli
bat
bazel
bison
boost
cairo
chruby
chruby-fish
chunkwm
clojure
cmake
cocoapods
colordiff
coreutils
dep
dhall-json
diff-so-fancy
direnv
docker
docker-compose
docker-machine
elixir
elvish
emacs
emacs-mac
emacs-plus
erlang
et
ffmpeg
findutils
fish
flac
fontconfig
freetype
frei0r
fribidi
fswatch
gcsfuse
gd
gdbm
gdk-pixbuf
gettext
gflags
giflib
git
glances
glib
glog
gmp
gnu-sed
gnupg
gnutls
go
gobject-introspection
gperf
graphite2
graphviz
harfbuzz
hexyl
htop
httpie
hub
icu4c
ilmbase
imagemagick
imagemagick@6
influxdb
jenv
john-jumbo
jpeg
jq
kafka
khd
kwm
lame
ldns
leiningen
leptonica
libass
libassuan
libbluray
libcroco
libde265
libevent
libffi
libgcrypt
libgpg-error
libheif
libidn2
libksba
libogg
libomp
libpng
libpq
librsvg
libsamplerate
libsndfile
libsodium
libsoxr
libssh2
libtasn1
libtiff
libtool
libunistring
libusb
libvorbis
libvpx
libyaml
libzip
little-cms2
lzo
lzop
magic-wormhole
mas
maven
md5sha1sum
mitmproxy
mobile-shell
mosh
mr
mtr
multitail
nasm
ncdu
ncurses
nettle
nginx
ninja
nmap
node
node@10
node@4
node@6
npth
nspr
nss
nvm
oniguruma
opencore-amr
openexr
openjpeg
openssh
openssl
openssl@1.1
opus
orc-tools
p11-kit
p7zip
pango
pcre
pcre2
pgcli
pigz
pinentry
pinentry-mac
pixman
pkg-config
poppler
postgresql
progress
protobuf
pstree
pv
python
python3
python@2
qpdf
qt
ranger
rbenv
readline
reattach-to-user-namespace
redis
rename
repo
ripgrep
rlwrap
rtmpdump
rubberband
ruby-build
ruby-install
rustup-init
s3cmd
sbt
scala
sdl2
shared-mime-info
shellcheck
snappy
socat
speedtest-cli
speex
sphinx-doc
sqlite
sshfs
task
terminal-notifier
tesseract
texinfo
tfenv
the_silver_searcher
thefuck
theora
tig
tldr
tmux
trash
tree
typescript
unbound
vault
watch
watchman
watson
webp
wget
whatmask
wxmac
x264
x265
xvid
xz
youtube-dl
zookeeper
zsh
