adns
apache-flink
apache-spark
aria2
asciidoctor
aspell
autoconf
autojump
automake
autossh
awscli
bat
bazel
bison
boost
cairo
chruby
chruby-fish
clojure
cmake
coreutils
curl
diff-so-fancy
docker
docker-machine
elvish
emacs
emacs-plus
fd
ffmpeg
fish
fontconfig
freetds
freetype
fribidi
fswatch
fzf
gd
gdbm
gdk-pixbuf
gettext
gflags
git
glances
glib
glog
gmp
gnu-sed
gnupg
gnutls
go
gobject-introspection
gperf
graphite2
graphviz
harfbuzz
htop
hub
icu4c
imagemagick
imagemagick@6
influxdb
jenv
jpeg
jq
kafka
lame
leiningen
libassuan
libcroco
libevent
libffi
libgcrypt
libgpg-error
libidn2
libksba
libogg
libpng
libpq
librsvg
libsodium
libssh2
libtasn1
libtiff
libtool
libunistring
libusb
libvorbis
libvpx
libyaml
libzip
little-cms2
lsusb
lua
lzo
lzop
magic-wormhole
mas
mitmproxy
mosh
mtr
multitail
ncdu
ncurses
nettle
nginx
nmap
node
node@4
node@6
npth
nspr
nss
nvm
oniguruma
openjpeg
openssh
openssl
openssl@1.1
opus
orc-tools
p11-kit
p7zip
pango
pcre
pcre2
perl
pgcli
pgloader
pigz
pinentry
pinentry-mac
pixman
pkg-config
poppler
postgresql
prettyping
progress
protobuf
pstree
pv
python
python@2
qpdf
rbenv
readline
reattach-to-user-namespace
redis
rename
ripgrep
rlwrap
ruby
ruby-build
ruby-install
s3cmd
sbcl
sbt
scala
scalastyle
sdl2
shellcheck
snappy
speedtest-cli
sqlite
sshfs
task
terminal-notifier
texinfo
tfenv
the_silver_searcher
thefuck
theora
tig
tldr
tmux
tree
typescript
unixodbc
vault
vim
watch
webp
weechat
wget
whatmask
x264
x265
xvid
xz
youtube-dl
zookeeper
zsh
