1password
alfred
amethyst
appearin
bartender
bettertouchtool
bitbar
caffeine
calibre
ccmenu
chatmate-for-whatsapp
chefdk
choosy
cleanmymac
contexts
cord
dash
divvy
docker
dropbox
etcher
fantastical
filebot
firefox
firefox-developer-edition
flume
flux
font-anonymous-pro
font-envy-code-r
font-fira-code
font-hack
font-inconsolata
font-inconsolata-dz
font-input
font-iosevka
font-m-plus
font-meslo-lg
font-source-code-pro
fork
gitify
gitkraken
google-chrome
google-cloud-sdk
gpg-suite
harvest
hazel
hp-easy-start
hyper
intellij-idea
istat-menus
iterm2
java
java8
keybase
keyboard-maestro
kindle
kitty
little-snitch
logitech-options
macdown
macvim
mailplane
monodraw
numi
omnifocus
omnigraffle
osxfuse
pester
plex-media-player
plex-media-server
postgres
qbittorrent
quicktime-player7
skype
slack
soulver
spark
spectacle
spotify
steam
sublime-text
switchresx
taskpaper
the-unarchiver
tower
transmission
tripmode
ubersicht
unified-remote
vagrant
vimr
virtualbox
viscosity
visual-studio-code
vlc
xee
xquartz
zoomus
