tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
cask "java"
cask "java8"
cask "osxfuse"
cask "xquartz"
# C/C++ resolver library and DNS resolver utilities
brew "adns"
# Scalable batch and stream data processing
brew "apache-flink"
# Engine for large-scale data processing
brew "apache-spark"
# SSL/TLS cryptography library
brew "openssl"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# GNU database manager
brew "gdbm"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Google's own build tool
brew "bazel"
# Parser generator
brew "bison"
# Collection of portable C++ source libraries
brew "boost"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Portable Foreign Function Interface library
brew "libffi"
# Perl compatible regular expressions library
brew "pcre"
# Core application library for C
brew "glib"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Ruby environment tool
brew "chruby"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Thin wrapper around chruby to make it work with the Fish shell
brew "chruby-fish"
# The Clojure Programming Language
brew "clojure"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Create Docker hosts locally and on cloud providers
brew "docker-machine", link: false
# Friendly and expressive shell
brew "elvish"
# GNU multiple precision arithmetic library
brew "gmp"
# ASN.1 structure parser library
brew "libtasn1"
# C string library for manipulating Unicode strings
brew "libunistring"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Image manipulation library
brew "jpeg"
# TIFF library and utilities
brew "libtiff"
# GNU Emacs text editor
brew "emacs", args: ["with-cocoa"], restart_service: true, link: false
# Simple, fast and user-friendly alternative to find
brew "fd"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# H.264/AVC encoder
brew "x264"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Generic library support script
brew "libtool"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Library for processing command-line flags
brew "gflags"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Alternative to top/htop
brew "glances"
# Application-level logging library
brew "glog"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Smart font renderer for non-Roman scripts
brew "graphite2"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Perfect hash function generator
brew "gperf"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# Time series, events, and metrics database
brew "influxdb"
# Manage your Java environment
brew "jenv"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Centralized server for distributed coordination of services
brew "zookeeper"
# Publish-subscribe messaging rethought as a distributed commit log
brew "kafka"
# Build tool for Clojure
brew "leiningen"
# CSS parsing and manipulation toolkit for GNOME
brew "libcroco"
# Asynchronous event library
brew "libevent"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Postgres C API library
brew "libpq"
# Library to render SVG files using Cairo
brew "librsvg"
# NaCl networking and cryptography library
brew "libsodium"
# YAML Parser
brew "libyaml"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Real-time data compression library
brew "lzo"
# File compressor
brew "lzop"
# Securely transfers data between computers
brew "magic-wormhole"
# Mac App Store command-line interface
brew "mas"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Remote terminal application
brew "mosh"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# NCurses Disk Usage
brew "ncdu"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@4"
# Platform built on V8 to build network applications
brew "node@6"
# Manage multiple Node.js versions
brew "nvm"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# ORC java command-line tools and utilities
brew "orc-tools"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Object-relational database system
brew "postgresql"
# Data loading tool for PostgreSQL
brew "pgloader"
# Parallel gzip
brew "pigz"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Progress: Coreutils Progress Viewer
brew "progress"
# Show ps output as a tree
brew "pstree"
# Monitor data's progress through a pipe
brew "pv"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Run scalastyle from the command-line
brew "scalastyle"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# File system client based on SSH File Transfer Protocol
brew "sshfs"
# Feature-rich console based todo list manager
brew "task"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Official documentation format of the GNU project
brew "texinfo"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Code-search similar to ack
brew "the_silver_searcher"
# Programatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Extensible IRC client
brew "weechat", args: ["with-aspell", "with-curl", "with-lua", "with-perl", "with-python@2", "with-ruby"]
# Internet file retriever
brew "wget"
# Network settings helper
brew "whatmask"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus", args: ["without-imagemagick@6"]
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
brew "railwaycat/emacsmacport/emacs-mac", link: false
cask "1password"
cask "adobe-acrobat-reader"
cask "alfred"
cask "amethyst"
cask "appearin"
cask "bartender"
cask "base"
cask "bettertouchtool"
cask "bitbar"
cask "caffeine"
cask "calibre"
cask "ccmenu"
cask "chatmate-for-whatsapp"
cask "chefdk"
cask "choosy"
cask "cleanmymac"
cask "contexts"
cask "cord"
cask "dash"
cask "datagrip"
cask "divvy"
cask "docker"
cask "dropbox"
cask "etcher"
cask "fantastical"
cask "filebot"
cask "firefox"
cask "firefox-developer-edition"
cask "flume"
cask "flux"
cask "font-anonymous-pro"
cask "font-envy-code-r"
cask "font-fira-code"
cask "font-hack"
cask "font-inconsolata"
cask "font-inconsolata-dz"
cask "font-input"
cask "font-iosevka"
cask "font-m-plus"
cask "font-meslo-lg"
cask "font-source-code-pro"
cask "fork"
cask "gitify"
cask "gitkraken"
cask "gitup"
cask "gmvault"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "harvest"
cask "hazel"
cask "hp-easy-start"
cask "hyper"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "keybase"
cask "keyboard-maestro"
cask "kindle"
cask "kitty"
cask "little-snitch"
cask "logitech-options"
cask "macdown"
cask "macvim"
cask "mailplane"
cask "monodraw"
cask "notion"
cask "numi"
cask "omnifocus"
cask "omnigraffle"
cask "pester"
cask "plex-media-player"
cask "plex-media-server"
cask "postgres"
cask "postico"
cask "qbittorrent"
cask "quicktime-player7"
cask "skype"
cask "slack"
cask "soulver"
cask "spark"
cask "spectacle"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "switchresx"
cask "taskpaper"
cask "the-unarchiver"
cask "tower"
cask "transmission"
cask "tripmode"
cask "ubersicht"
cask "unified-remote"
cask "vagrant"
cask "vimr"
cask "virtualbox"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "xee"
cask "zoomus"
mas "Airmail 3", id: 918858936
mas "Bear", id: 1091189122
mas "Habitify", id: 1140787122
mas "Microsoft OneNote", id: 784801555
mas "Pages", id: 409201541
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pixelmator", id: 407963104
mas "Reeder", id: 880001334
mas "Tweetbot", id: 1384080005
mas "Xcode", id: 497799835
