1password
adobe-acrobat-reader
amethyst
android-studio
appearin
bartender
bettertouchtool
bitbar
caffeine
chatmate-for-whatsapp
chefdk
chromedriver
cleanmymac
cord
dash
discord
divvy
docker
emacs-mac
fastlane
filebot
firefox-beta
flume
flux
font-hack
font-hack-nerd-font
font-inconsolata
font-input
font-iosevka
font-source-code-pro
forklift
gitify
gitkraken
google-cloud-sdk
gpg-suite
hp-easy-start
hyper
istat-menus
java
java8
kitty
little-snitch
macdown
macvim
mailplane
osxfuse
pester
plex-media-server
postgres
renamer
ripcord
setapp
skype
sloth
soulver
spark
spectacle
steam
sublime-merge
sublime-text
tower
transmission-remote-gui
unified-remote
vagrant
virtualbox
visual-studio-code
wireshark
xee
xquartz
